# -*- coding: utf-8 -*-
"""
-------------------------------------------------
  IDE         : PyCharm
  File Name   : 35
  Description :


🎃样例1
输入
21
输出
21=10+11
说明:
21可以分解的连续正整数组合的形式有多种
21=1+2+3+4+5+6
21=6+7+8
21=10+11
因21=10+11,是最短的分解序列。所以答案是21=10+11


🎃样例2
输入
9
输出
9=4+5
说明:
9=2+3+4
9=4+5


🎃样例4
输入
15
输出
15=7+8
说明:
15=1+2+3+4+5
15=4+5+6
15=7+8


  Summary     : 1、求和公式，来求首项
                2、判断一个数字是否只有整数 = 判断小数等于0 = （ x%1 == 0）
                3、
  Author      : chenyushencc@gmail.com
  date        : 2024/1/17 18:04
-------------------------------------------------
"""


def solution(sn):
    """ 将 n 拆为连续的数字相加，要求数字个数最小 """
    if sn % 2 == 1:      # 奇数，必可以用2位连续的数表示
        return f"{(sn-1)//2}+{(sn-1)//2 +1}"

    # 一般解法,根据求和公式，设首项x，从2开始，sn = xn + (n*(n-1)*)1//2，解得 x = (sn - (n*(n-1)*1)//2) // n
    for n in range(2, sn):
        x = (sn - (n*(n-1)*1)//2) / n

        if x%1 == 0 and x > 0:          # 判断当前的数字是否只有只有整数
            seq = [str(int(x + i)) for i in range(n)]
            return "+".join(seq)

    return "N"


if __name__ == "__main__":
    n = int(input())
    print(f"{n}=" + solution(n))
